Ran Plan for dir: `terraform/stacks/stackkit-test-dev-ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/bin/terraform1.7.5 plan -input=false -refresh -no-color -out \"/atlantis/repos/ryu-qqq/stackkit-test/1/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/stackkit-test-dev-ap-northeast-2-default.tfplan\" -lock-timeout=10m -out=$PLANFILE" in "/atlantis/repos/ryu-qqq/stackkit-test/1/default/terraform/stacks/stackkit-test-dev-ap-northeast-2": exit status 1
module.vpc.data.aws_availability_zones.available: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # null_resource.atlantis_test will be created
  + resource "null_resource" "atlantis_test" {
      + id       = (known after apply)
      + triggers = {
          + "timestamp" = (known after apply)
        }
    }

  # module.test_bucket.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + tags_all                    = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.test_bucket.aws_s3_bucket_lifecycle_configuration.main[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "logs_lifecycle"
          + status = "Enabled"

          + transition {
              + days          = 45
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_bucket.aws_s3_bucket_server_side_encryption_configuration.main will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_versioning.main will be created
  + resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + tags_all = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stackkit-test-dev-default-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + tags_all               = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
      + tags_all                             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + stack_name       = "stackkit-test-dev-ap-northeast-2"
  + test_bucket_arn  = (known after apply)
  + test_bucket_name = "test-logs"
  + vpc_cidr_block   = "10.0.0.0/16"
  + vpc_id           = (known after apply)

Warning: Invalid Attribute Combination

  with module.test_bucket.aws_s3_bucket_lifecycle_configuration.main[0],
  on ../../modules/s3/main.tf line 42, in resource "aws_s3_bucket_lifecycle_configuration" "main":
  42: resource "aws_s3_bucket_lifecycle_configuration" "main" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

Error: fetching Availability Zones: operation error EC2: DescribeAvailabilityZones, https response error StatusCode: 403, RequestID: ebc82554-9803-4e92-9750-619c291fb4be, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::646886795421:assumed-role/prod-atlantis-task-role/c60258fdb3824e57992acb1df7446654 is not authorized to perform: ec2:DescribeAvailabilityZones because no identity-based policy allows the ec2:DescribeAvailabilityZones action

  with module.vpc.data.aws_availability_zones.available,
  on ../../modules/vpc/data.tf line 1, in data "aws_availability_zones" "available":
   1: data "aws_availability_zones" "available" {


```
</details>

